<!-- dflook/terraform-github-actions {"workspace":"default","backend":"3512eaca3a70b4151ce8bdf05ac19c9f453ac6db79aaf9a4f5da1b7dba3cc3e9","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #246 at https://github.com/dflook/terraform-github-actions/actions/runs/3122832201","plan_hash":"792cc9d07ede21d2115b2dc0ebcddec88ed6e39b5d1b573c8f714e181128cc4c","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "skq5AmdEdz" -> (known after apply)
  ~ foreach = "FfGUURr2rp" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #246](https://github.com/dflook/terraform-github-actions/actions/runs/3122832201)